Repository: jimmyskull/Wooki
Catalog: wooki/locale/*/LC_MESSAGES/wooki.po
Languages: pt_br

source: Reached maximum of benchmarks
pt_br: Número máximo de benchmarks atingido

source: Time: %lf
pt_br: Tempo: %lf

source: Memory: %i bytes
pt_br: Memória: %i bytes

source: Benchmark Tool
pt_br: Ferramenta de Benchmark

source: Missing name for benchmark. (ex: bm save bma)
pt_br: Faltando o nome para o benchmark. (ex: bm save bma)

source: Missing name for benchmark. (ex: bm compare a b)
pt_br: Faltando nome para o benchmark. (ex: bm compare a b)

source: New integer @ %p
pt_br: Novo inteiro @ %p

source: Warning: can't read integer.
pt_br: Atenção: não foi possível ler inteiro.

source: Type not defined!
pt_br: Tipo não definido!

source: Read with success: %d
pt_br: Leitura sucedida: %d

source: Can't set type. It is fixed.
pt_br: Não foi possível alterar tipo. Está bloqueado.

source: Setting debug level to %d.
pt_br: Mudando nível de debug para %d.

source: Bye!
pt_br: Tchau!

source: There is no selected object for this operation.
pt_br: Não há nenhum objeto selecionado para esta operação.

source: Object %s%s%s was not found.
pt_br: Objeto %s%s%s não encontrado.

source: Can't read '%s' as %s
pt_br: Não foi possível ler '%s' como um %s

source: Can't generate random value betweeb this range
pt_br: Não foi possível gerar valor aleatório dentro da margem

source: Generating random (%d..%d):
pt_br: Gerando número aleatório (%d..%d):

source: Generated random value: %d
pt_br: Número aleatório gerado: %d

source: Data type set to %s%s%s
pt_br: Tipo de dados alterado para %s%s%s

source: Can't change type to '%s'
pt_br: Não foi possível mudar tipo para '%s'

source: Memory optimization: %s%s%s
pt_br: Otimização da memória: %s%s%s

source: activated
pt_br: ativado

source: disabled
pt_br: desativado

source: Object %s%s%s not found. Type "print objects" to get a list of installed objects.
pt_br: Objeto %s%s%s não encontrado. Digite "print objects" para ver a lista de objetos instalados.

source: Object %s%s%s not found.
pt_br: Objeto %s%s%s não encontrado.

source: Calling parser @ %s%p%s
pt_br: Chamando analizador @ %s%p%s

source: Opcode %s%s%s is not defined.
pt_br: O opcode %s%s%s não está definido.

source: Can't register parser for '%s'. No space left.
pt_br: Não foi possível registrar analizador para '%s'. Sem espaço.

source: Parser registered: OP Code: %s%s%s Function: %s%p%s
pt_br: Analizador registrado: OP Code: %s%s%s Função: %s%p%s

source: Initializing parser..
pt_br: Inicializando analizador..

source: Finalizing parser..
pt_br: Finalizando analizador..

source: TokenOverflow: The line has reached the limit.
pt_br: TokenOverflow: A linha atingiu o limite de tamanho.

source: Ignoring line (too big)
pt_br: Ignorando linha (muito grande)

source: Token '%s' is bigger than allowed. Skipping.
pt_br: Símbolo '%s' é maior que o permitido. Ignorando.

source: EOF Received
pt_br: EOF Recebido

source: Type "help", "copyright" or "license" for more information.
pt_br: Digite "help", "copyright" ou "license" para mais informações.

source: Debug level: %s%s%s
pt_br: Nível de debug: %s%s%s

source: basic
pt_br: básico

source: extreme
pt_br: extremo

source: non-sense!
pt_br: sem-noção!

source: Initializing core..
pt_br: Inicializando núcleo..

source: Finalizing core..
pt_br: Finalizando núcleo..

source: [object]
pt_br: [objeto]

source: Print an object. Available built-in objects: objects List installed objects. registers List interpreter registers values ewok Information about the memory management
pt_br: Imprime um objeto. Objetos do interpretador: objects Lista os objetos instalados. registers Lista os registradores do interpretador ewok Informação sobre o gerenciamento de memória

source: [level]
pt_br: [nível]

source: Set debug level. Informations about the interpreter and data structs are printed to stderr according to level set. Example: debug 1 -- Set to basic debug 0 no debug. Only errors are showed. 1 basic debug. 2 extreme debug. 3 non-sense debug. Not recommended for users.
pt_br: Definir o nível de debug. Informações sobre o interpretador e o objeto são imprimidas em stderr de acordo com o nível definido. Exemplo: debug 1 -- Define o debug para o nível básico 0 sem debug. Apenas erros são mostrados. 1 debug básico. 2 debug extremo. 3 debug sem-noção. Não recomendado para usuários.

source: [from] [to] [destination]
pt_br: [de] [até] [destino]

source: Generate a random value. Generate a random value and throw to the destination. The destination can be a register, a buffer or a opcode Example: rnd 10 40 %%eax -- Random between 10 and 40, store in %%eax
pt_br: Gerar um valor aleatório. Gera um valor aleatório e joga para o destino. O destino pode ser um registrador, um buffer ou um comando Exemplo: rnd 10 40 %%eax -- Valor entre 10 e 40, armazena em %%eax

source: Set data type to be stored. After allocate an object the type is fixed, and will not be able to change anymore. Example: type int -- Set data type to integers
pt_br: Definir tipo de dados para serem armazenados. Depois de criar um objeto, o tipo de dados é fixado, não permitindo alterações posteriormente. Exemplo: type int -- Muda o tipo de dados para inteiros

source: [boolean]
pt_br: [lógico]

source: Memory Optimization If activated, when a new data is going to be pushed to a data structure, register or buffer, the interpreter will search into already allocated data for same value. If found, a reference to this data is passed, avoiding Note: memory optimization must be defined in the very start of the program! memory duplication. Activate: optmem 1 Deactivate: optmem 0
pt_br: Otimização da Memória Se ativada, quando um novo dado entrar no programa para uma estrutura de dados, registrador ou buffer, o interpretador irá buscar pelo mesmo valor nos dados que já entraram no programa. Se encontrado, uma referencia para esse dado é passado, evitando duplicação de dados. Nota: otimização de memória precisa ser definida bem no início do programa! Ativar: optmem 1 Desativar: optmem 0

source: [from] to [to] (step [step]), [command]
pt_br: [de] to [até] (step [pular]), [comando]

source: Run a loop iteration Execute a command, passing values between a range, and if defined stepping values. Examples: for 1 to 5, append -- Equivalent: append 1 2 3 4 5 for 2 to 10 step 2, append -- Equivalent: append 2 4 6 8 10
pt_br: Executar iterações Executa um comando, passando os valores dentro de uma margem de valores, e se definido, pulando valores. Exemplos: for 1 to 5, append -- Equivalente: append 1 2 3 4 5 for 2 to 10 step 2, append -- Equivalente: append 2 4 6 8 10

source: [times], [command]
pt_br: [vezes], [comando]

source: Show Memory Analysis Use this command to see the program memory status.
pt_br: Mostrar Análise da Memória Use este comando para ver informações atuais da memória do programa.

source: Garbage Collector Invoke Ewoks to free input data.
pt_br: Coletor de Lixo Invoca Ewoks pra a onerosa tarefa de remover o lixo (dados de entrada).

source: Exit Interpreter Exit from interpreter program returning status OK to system.
pt_br: Sair do Interpretador Sair do programa interpretador retornando status OK para o sistema.

source: Create an instance of object. When command new is executed the command "sel [object]" is implicitly run.
pt_br: Cria uma instância do objecto. Quando o comando new for executado o comando "sel [object]" é implicitamente executado.

source: Push values into data structure Example: push 1 2 3
pt_br: Executar PUSH dos valores para a estrutura de dados Exemplo: push 1 2 3

source: Select an object to work with.
pt_br: Seleciona um objeto para trabalhar.

source: You must select a object before use commands.
pt_br: Você deve selecionar um objeto antes de executar comandos.

source: Trigger not found.
pt_br: Gatilho não encontrado.

source: %s%sWarning%s: object is null!
pt_br: %s%sAtenção%s: objeto está nulo!

source: %s%sError%s: operation blocked by safe_working. (object is null)
pt_br: %s%sErro%s: operação bloqueada pelo safe_working. (o objeto está nulo)

source: Skipping trigger: number of parameteres do not reach minimum allowed.
pt_br: Pulando gatilho: número de parâmetros não atingem o mínimo permitido.

source: Skipping trigger: number of parameteres ultrapass maximum allowed.
pt_br: Pulando gatilho: número de parâmetros ultrapassam o máximo permitido.

source: Calling user trigger..
pt_br: Chamando gatilho..

source: Updating object pointer from %p to %p
pt_br: Atualizando ponteiro do objeto: de %p para %p

source: Can't register trigger for '%s'. No space left.
pt_br: Não foi possível registrar gatilho para '%s'. Sem espaço.

source: Trigger registered (for object %s%s%s) OP Code: %s%s%s Function: %s%p%s
pt_br: Gatilho registrado (para o objeto %s%s%s) OP Code: %s%s%s Função: %s%p%s

source: Object found!
pt_br: Objeto encontrado!

source: There are %d objects. The list bellow show each object separated by class name.
pt_br: Há %d objetos. A lista abaixo mostra cada objeto organizado pelas classes dos objetos.

source: %sClass %s%s%s
pt_br: %sClasse %s%s%s

source: Object information
pt_br: Informação do Objeto

source: Name
pt_br: Nome

source: currently created
pt_br: está criado

source: not created
pt_br: não está criado

source: Class name
pt_br: Classe

source: Triggers
pt_br: Gatilhos

source: takes no paramaters
pt_br: não aceita parâmetros

source: takes %d parameters
pt_br: aceita %d parâmetros

source: no restriction for parameters count
pt_br: sem restrição no número de parâmetros

source: takes up to %d %s
pt_br: aceita até %d %s

source: parameter
pt_br: parâmetro

source: parameters
pt_br: parâmetros

source: takes at least %d %s
pt_br: precisa de pelo menos %d %s

source: accepts from %d until %d parameters
pt_br: aceita de %d até %d parâmetros

source: Can't register object '%s'. It already exists.
pt_br: Não foi possível registrar objeto '%s'. Ele já existe.

source: New object: %s%s%s %s@%s %s%p%s
pt_br: Novo objeto: %s%s%s %s@%s %s%p%s

source: %sMemory Info%s
pt_br: %sStatus da Memória%s

source: %sTotal bytes allocated%s: %i bytes
pt_br: %sTotal de bytes alocados%s: %i bytes

source: %sChunks not being used%s: %i
pt_br: %sPedaços não sendo utilizados%s: %i

source: %sNumber of chunks allocated with mmap%s: %i
pt_br: %sPedaços alocados com mmap%s: %i

source: %sSize of chunks allocated with mmap%s: %i bytes
pt_br: %sTamanho dos pedaços alocados com mmap%s: %i bytes

source: %sTotal allocated with malloc%s: %i bytes
pt_br: %sTotal alocado com malloc%s: %i bytes

source: %sTotal memory not in use%s: %i bytes
pt_br: %sTotal de memória liberada%s: %i bytes

source: %sTop-most releasable chunk size%s: %i bytes
pt_br: %sTamanho do pedaço mais liberável%s: %i bytes

source: No help for %s
pt_br: Ajuda não encontrada para %s

source: %sWooki Interpreter Help%s Wooki interpreter is a program to help in analysis of data structures, with tools for benchmarking and debug. The data structures are compiled with the interpreter, and they are connect to the interpreter throught an interface. To see all interfaces (objects), type "print objects" To start using an object, first you need to create an object and then commands for the structure can be passed. How to use help Type "help" and the item you want to see about, for instance: help new -- Show help information for "new" command.
pt_br: %sAjuda do Interpretador Wooki%s Interpretador Wooki é um programa para ajudar na análise de estrutura de dados, com ferramentos para benchmarking e debug. As estruturas de dados são compiladas junto com o interpretador, sendo ligadas através de uma interface. Para ver todas as interfaces (objetos), digite "print objects" Para começar a usar um objecto, primeiro você precisa criá-lo, para que então, os comandos digitados possam ser passados para as estruturas. Como usar a ajuda Digite "help" e o termo que você deseja ver, por exemplo: help new -- Mostra informações sobre o comando "new".

source: Copyright (c) 2011 Chewbacca Software Foundation. All Rights Reserved.
pt_br: Copyright (c) 2011 Chewbacca Software Foundation. Todos os direitos reservados.

source: Copyright (c) 2011 Paulo Roberto Urio. All Rights Reserved.
pt_br: Copyright (c) 2011 Paulo Roberto Urio. Todos os direitos reservados.

source: This work is licensed under the Creative Commons Attribution-NonCommercial 3.0 Unported License. To view a copy of this license, visit http://creativecommons.org/licenses/by-nc/3.0/ or send a letter to Creative Commons, 171 Second Street, Suite 300, San Francisco, California, 94105, USA. %sYou are free%s: %sto Share%s — to copy, distribute and transmit the work %sto Remix%s — to adapt the work %sUnder the following conditions%s: %sAttribution%s — You must attribute the work in the manner specified by the author or licensor (but not in any way that suggests that they endorse you or your use of the work). %sNoncommercial%s — You may not use this work for commercial purposes. %sWith the understanding that%s: %sWaiver%s — Any of the above conditions can be waived if you get permission from the copyright holder. %sPublic Domain%s — Where the work or any of its elements is in the public domain under applicable law, that status is in no way affected by the license. %sOther Rights%s — In no way are any of the following rights affected by the license: ◉ Your fair dealing or fair use rights, or other applicable copyright exceptions and limitations; ◉ The author's moral rights; ◉ Rights other persons may have either in the work itself or in how the work is used, such as publicity or privacy rights. %sNotice%s — This is a human-readable summary of the Legal Code. Check out the full license in the web site.
pt_br: A presente obra encontra-se licenciada sob a licença Creative Commons Attribution-NonCommercial 3.0 Brazil. Para visualizar uma cópia da licença, visite http://creativecommons.org/licenses/by-nc/3.0/br/ ou mande uma carta para: Creative Commons, 171 Second Street, Suite 300, San Francisco, California, 94105, USA. %sVocê tem a liberdade de%s: %sCompartilhar%s — copiar, distribuir e transmitir a obra. %sRemixar%s — criar obras derivadas. %sSob as seguintes condições%s: %sAtribuição%s — Você deve creditar a obra da forma especificada pelo autor ou licenciante (mas não de maneira que sugira que estes concedem qualquer aval a você ou ao seu uso da obra). %sUso não-comercial%s — Você não pode usar esta obra para fins comerciais. %sFicando claro que%s: %sRenúncia%s — Qualquer das condições acima pode ser renunciada se você obtiver permissão do titular dos direitos autorais. %sDomínio Público%s — Onde a obra ou qualquer de seus elementos estiver em domínio público sob o direito aplicável, esta condição não é, de maneira alguma, afetada pela licença. %sOutros Direitos%s — Os seguintes direitos não são, de maneira alguma, afetados pela licença: ◉ Limitações e exceções aos direitos autorais ou quaisquer usos livres aplicáveis; ◉ Os direitos morais do autor; ◉ Direitos que outras pessoas podem ter sobre a obra ou sobre a utilização da obra, tais como direitos de imagem ou privacidade. %sAviso%s — Este é um resumo amigável da Licença Jurídica. Veja a licença integralmente na internet.

source: Found reference of %p @ %p!
pt_br: Referência encontrada! %p @ %p

source: No reference was found. Creating:
pt_br: Nenhum referência foi encontrada. Criando:

source: Memory Optimization
pt_br: Otimização da memória

source: deactivated
pt_br: desativado

source: Safe working
pt_br: Modo seguro

source: Data type
pt_br: Tipo de dados

source: Items in cache
pt_br: Itens em cache

source: Initializing runtime..
pt_br: Inicializando runtime..

source: Finalizing runtime..
pt_br: Finalizando runtime..

source: New stack allocated at %s%p%s
pt_br: Nova pilha alocada em %s%p%s

source: Stack freed.
pt_br: A pilha foi liberada.

source: Stack is empty
pt_br: A pilha está vazia

source: Syntax
pt_br: Sintaxe
